Tekla Open API Reference for Tekla Structures 2025
AnalysisPartSpanningProperties.SpanningType Property
 The spanning type.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisPartSpanningProperties.SpanningTypeEnum SpanningType { get; set; }
Public Property SpanningType As AnalysisPartSpanningProperties.SpanningTypeEnum
	Get
	Set
Property Value
Type: AnalysisPartSpanningProperties.SpanningTypeEnum
See Also
Reference
AnalysisPartSpanningProperties Class
Tekla.Structures.Analysis Namespace